emsesp/EMS-ESP32/src/web/WebSettingsService.cpp
    settings.locale = root["locale"] | EMSESP_DEFAULT_LOCALE;
    EMSESP::system_.locale(settings.locale);
    if (Mqtt::ha_enabled() && original_settings.locale != settings.locale) {
        add_flags(ChangeFlags::MQTT);
    }

    //
    // without checks or necessary restarts...
    //
    settings.trace_raw = root["trace_raw"] | EMSESP_DEFAULT_TRACELOG_RAW;
    EMSESP::trace_raw(settings.trace_raw);

    settings.notoken_api            = root["notoken_api"] | EMSESP_DEFAULT_NOTOKEN_API;
    settings.solar_maxflow          = root["solar_maxflow"] | EMSESP_DEFAULT_SOLAR_MAXFLOW;
    settings.boiler_heatingoff      = root["boiler_heatingoff"] | EMSESP_DEFAULT_BOILER_HEATINGOFF;
    settings.remote_timeout         = root["remote_timeout"] | EMSESP_DEFAULT_REMOTE_TIMEOUT;
    settings.remote_timeout_enabled = root["remote_timeout_en"] | EMSESP_DEFAULT_REMOTE_TIMEOUT_EN;
    Roomctrl::set_timeout(settings.remote_timeout_enabled ? settings.remote_timeout : 0);

    settings.fahrenheit = root["fahrenheit"];
    EMSESP::system_.fahrenheit(settings.fahrenheit);

    settings.readonly_mode = root["readonly_mode"];
    EMSESP::system_.readonly_mode(settings.readonly_mode);

    settings.developer_mode = root["developer_mode"];
    EMSESP::system_.developer_mode(settings.developer_mode);

    settings.bool_dashboard = root["bool_dashboard"] | EMSESP_DEFAULT_BOOL_FORMAT;
    EMSESP::system_.bool_dashboard(settings.bool_dashboard);

    settings.weblog_level   = root["weblog_level"] | EMSESP_DEFAULT_WEBLOG_LEVEL;
    settings.weblog_compact = root["weblog_compact"] | EMSESP_DEFAULT_WEBLOG_COMPACT;

    // if no psram limit weblog buffer to 25 messages
    if (EMSESP::system_.PSram() > 0) {
        settings.weblog_buffer = root["weblog_buffer"] | EMSESP_DEFAULT_WEBLOG_BUFFER;
    } else {
        settings.weblog_buffer = root["weblog_buffer"] | 25; // limit to 25 messages if no psram
    }

    // save the settings if changed from the webUI
    // if we encountered an invalid GPIO, rollback changes and don't save settings, and report the error to WebUI
    if (!have_valid_gpios) {
        // replace settings with original settings
        settings = original_settings; // the original settings are still valid
        // restore the GPIOs from the snapshot
        EMSESP::system_.restore_snapshot_gpios();

        // report the error to WebUI
        EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_INVALID_GPIO);
        return StateUpdateResult::ERROR; // don't save the settings if the GPIOs are invalid
    }

    // clean up snapshot of the GPIOs
    EMSESP::system_.clear_snapshot_gpios();

    // save the setting internally, for reference later
    EMSESP::system_.store_settings(settings);

    if (has_flags(WebSettings::ChangeFlags::RESTART)) {
        return StateUpdateResult::CHANGED_RESTART;
    }

    return StateUpdateResult::CHANGED;
}

// this is called after any of the settings have been persisted to the filesystem
// either via the Web UI or via the Console
void WebSettingsService::onUpdate() {
    // skip if we're restarting anyway

    if (WebSettings::has_flags(WebSettings::ChangeFlags::RESTART)) {
        return;
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::SHOWER)) {
        EMSESP::shower_.start();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::TEMPERATURE_SENSOR)) {
        EMSESP::temperaturesensor_.start();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::UART)) {
        EMSESP::system_.uart_init();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::SYSLOG)) {
        EMSESP::system_.syslog_init(); // re-start (or stop)
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::ANALOG_SENSOR)) {
        EMSESP::analogsensor_.start();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::BUTTON)) {
        EMSESP::system_.button_init();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::LED)) {
        EMSESP::system_.led_init();
    }

    if (WebSettings::has_flags(WebSettings::ChangeFlags::MQTT)) {
        Mqtt::reset_mqtt(); // reload MQTT, init HA etc
    }

    WebSettings::reset_flags();
}

void WebSettingsService::begin() {
    _fsPersistence.readFromFS();
}

void WebSettingsService::save() {
    _fsPersistence.writeToFS();
}

// send the board profile as JSON
void WebSettingsService::board_profile(AsyncWebServerRequest * request) {
    if (request->hasParam("boardProfile")) {
        std::string board_profile = request->getParam("boardProfile")->value().c_str();

        auto *     response = new AsyncJsonResponse(false);
        JsonObject root     = response->getRoot();

        // 0=led, 1=dallas, 2=rx, 3=tx, 4=button, 5=phy_type, 6=eth_power, 7=eth_phy_addr, 8=eth_clock_mode, 9=led_type
        std::vector<int8_t> data;
        (void)System::load_board_profile(data, board_profile);
        root["board_profile"]  = board_profile;
        root["led_gpio"]       = data[0];
        root["dallas_gpio"]    = data[1];
        root["rx_gpio"]        = data[2];
        root["tx_gpio"]        = data[3];
        root["pbutton_gpio"]   = data[4];
        root["phy_type"]       = data[5];
        root["eth_power"]      = data[6];
        root["eth_phy_addr"]   = data[7];
        root["eth_clock_mode"] = data[8];
        root["led_type"]       = data[9];

        response->setLength();
        request->send(response);
        return;
    }

    AsyncWebServerResponse * response = request->beginResponse(200);
    request->send(response);
}

// loads the board profile to set the gpios
// if the board profile is not found, or default, it will try to autodetect the board profile
void WebSettings::set_board_profile(WebSettings & settings) {
    // The optional NVS boot value has priority and overrides any board_profile setting.
    // This is only done for BBQKees boards
    // Note 1: we never set the NVS boot value in the code - this is done on initial pre-loading
    // Note 2: The board profile is dynamically changed for the session, but the value in the settings file on the FS remains untouched
    if (EMSESP::system_.getBBQKeesGatewayDetails(FUSE_VALUE::MFG).startsWith("BBQKees")) {
        String bbq_board = EMSESP::system_.getBBQKeesGatewayDetails(FUSE_VALUE::BOARD);
        if (!bbq_board.isEmpty()) {
#if defined(EMSESP_DEBUG)
            EMSESP::logger().info("Overriding board profile with fuse value %s", bbq_board.c_str());
#endif
            settings.board_profile = bbq_board;
        }
    }

    // if it's CUSTOM no need to load the board profile from the settings
    // as it's already set
    if (settings.board_profile == "CUSTOM") {
        EMSESP::logger().info("Using CUSTOM board profile");
        return;
    }

    // load the board profile into the data vector
    // 0=led, 1=dallas, 2=rx, 3=tx, 4=button, 5=phy_type, 6=eth_power, 7=eth_phy_addr, 8=eth_clock_mode, 9=led_type
    std::vector<int8_t> data(10, 99); // initialize with 99 for all values, just as a safe guard to catch bad gpios
    if (settings.board_profile != "default") {
        if (!System::load_board_profile(data, settings.board_profile.c_str())) {
#if defined(EMSESP_DEBUG)
            EMSESP::logger().debug("Unable to identify board profile %s", settings.board_profile.c_str());
#endif
            settings.board_profile = "default"; // can't find profile, fallback to "default"
        }
    }

    // we still don't have a valid board profile. Let's see if we can determine one from the build config or hardware
    if (settings.board_profile == "default") {
        EMSESP::logger().info("Autodetecting board profile");
#if CONFIG_IDF_TARGET_ESP32
        // check for no PSRAM, could be a E32 or S32?
        if (!ESP.getPsramSize()) {
#if ESP_ARDUINO_VERSION_MAJOR < 3
            if (ETH.begin(1, 16, 23, 18, ETH_PHY_LAN8720, ETH_CLOCK_GPIO0_IN)) {
#else
            if (ETH.begin(ETH_PHY_LAN8720, 1, 23, 18, 16, ETH_CLOCK_GPIO0_IN)) {
#endif
                settings.board_profile = "E32"; // Ethernet without PSRAM
            } else {
                settings.board_profile = "S32"; // ESP32 standard WiFi without PSRAM
            }
        } else {
// check for boards with PSRAM, could be a E32V2 otherwise default back to the S32
#if ESP_ARDUINO_VERSION_MAJOR < 3
            if (ETH.begin(0, 15, 23, 18, ETH_PHY_LAN8720, ETH_CLOCK_GPIO0_OUT)) {
#else
            if (ETH.begin(ETH_PHY_LAN8720, 0, 23, 18, 15, ETH_CLOCK_GPIO0_OUT)) {
#endif

                if (analogReadMilliVolts(39) > 700) {   // core voltage > 2.6V
                    settings.board_profile = "E32V2_2"; // Ethernet, PSRAM, internal sensors
                } else {
                    settings.board_profile = "E32V2"; // Ethernet and PSRAM
                }
            } else {
                settings.board_profile = "S32"; // ESP32 standard WiFi with PSRAM
            }
        }
// override if we know the target from the build config like C3, S2, S3 etc..
#elif CONFIG_IDF_TARGET_ESP32C3
        settings.board_profile = "C3MINI";
#elif CONFIG_IDF_TARGET_ESP32S2
        settings.board_profile = "S2MINI";
#elif CONFIG_IDF_TARGET_ESP32S3
        settings.board_profile = "S32S3"; // BBQKees Gateway S3
#endif
        // apply the new board profile setting
        System::load_board_profile(data, settings.board_profile.c_str());
    }

    EMSESP::logger().info("Loaded board profile %s", settings.board_profile.c_str());

    // apply the new board profile settings
    // 0=led, 1=dallas, 2=rx, 3=tx, 4=button, 5=phy_type, 6=eth_power, 7=eth_phy_addr, 8=eth_clock_mode, 9=led_type
    settings.led_gpio       = data[0]; // LED GPIO
    settings.dallas_gpio    = data[1]; // Dallas GPIO
    settings.rx_gpio        = data[2]; // UART Rx GPIO
    settings.tx_gpio        = data[3]; // UART Tx GPIO
    settings.pbutton_gpio   = data[4]; // Button GPIO
    settings.phy_type       = data[5]; // PHY Type
    settings.eth_power      = data[6]; // Ethernet Power GPIO
    settings.eth_phy_addr   = data[7]; // Ethernet PHY Address
    settings.eth_clock_mode = data[8]; // Ethernet Clock Mode
    settings.led_type       = data[9]; // LED Type
}

// returns true if the value was changed
bool WebSettings::check_flag(int prev_v, int new_v, uint8_t flag) {
    if (prev_v != new_v) {
        add_flags(flag);
#if defined(EMSESP_DEBUG)
        // EMSESP::logger().debug("check_flag: flag %d, prev_v=%d, new_v=%d", flag, prev_v, new_v);
#endif
        return true;
    }
    return false;
}

void WebSettings::add_flags(uint8_t flags) {
    flags_ |= flags;
}

bool WebSettings::has_flags(uint8_t flags) {
    return (flags_ & flags) == flags;
}

void WebSettings::reset_flags() {
    flags_ = ChangeFlags::NONE;
}

uint8_t WebSettings::get_flags() {
    return flags_;
}

} // namespace emsesp
